perfTest/stage4/get.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.06ms    4.31ms  22.08ms   84.33%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.33ms
 75.000%    1.95ms
 90.000%    9.90ms
 99.000%   19.34ms
 99.900%   21.73ms
 99.990%   22.03ms
 99.999%   22.09ms
100.000%   22.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.099     0.000000            1         1.00
       0.607     0.100000          962         1.11
       0.807     0.200000         1927         1.25
       0.973     0.300000         2886         1.43
       1.152     0.400000         3851         1.67
       1.326     0.500000         4816         2.00
       1.414     0.550000         5291         2.22
       1.510     0.600000         5772         2.50
       1.613     0.650000         6255         2.86
       1.749     0.700000         6735         3.33
       1.948     0.750000         7215         4.00
       2.101     0.775000         7455         4.44
       2.461     0.800000         7696         5.00
       5.635     0.825000         7936         5.71
       7.779     0.850000         8177         6.67
       8.831     0.875000         8418         8.00
       9.335     0.887500         8537         8.89
       9.903     0.900000         8659        10.00
      10.495     0.912500         8778        11.43
      11.175     0.925000         8898        13.33
      12.175     0.937500         9018        16.00
      12.679     0.943750         9078        17.78
      13.327     0.950000         9139        20.00
      14.367     0.956250         9199        22.86
      14.895     0.962500         9260        26.67
      15.583     0.968750         9320        32.00
      16.007     0.971875         9349        35.56
      16.463     0.975000         9379        40.00
      17.183     0.978125         9409        45.71
      17.791     0.981250         9439        53.33
      18.303     0.984375         9469        64.00
      18.591     0.985938         9485        71.11
      18.847     0.987500         9499        80.00
      19.183     0.989062         9514        91.43
      19.503     0.990625         9529       106.67
      19.807     0.992188         9544       128.00
      19.967     0.992969         9552       142.22
      20.223     0.993750         9559       160.00
      20.527     0.994531         9567       182.86
      20.703     0.995313         9574       213.33
      20.863     0.996094         9582       256.00
      20.927     0.996484         9586       284.44
      20.991     0.996875         9589       320.00
      21.103     0.997266         9593       365.71
      21.247     0.997656         9597       426.67
      21.407     0.998047         9601       512.00
      21.519     0.998242         9603       568.89
      21.567     0.998437         9604       640.00
      21.631     0.998633         9606       731.43
      21.695     0.998828         9608       853.33
      21.759     0.999023         9610      1024.00
      21.791     0.999121         9611      1137.78
      21.823     0.999219         9612      1280.00
      21.855     0.999316         9613      1462.86
      21.903     0.999414         9614      1706.67
      21.935     0.999512         9615      2048.00
      21.935     0.999561         9615      2275.56
      21.967     0.999609         9616      2560.00
      21.967     0.999658         9616      2925.71
      21.999     0.999707         9617      3413.33
      21.999     0.999756         9617      4096.00
      21.999     0.999780         9617      4551.11
      22.031     0.999805         9618      5120.00
      22.031     0.999829         9618      5851.43
      22.031     0.999854         9618      6826.67
      22.031     0.999878         9618      8192.00
      22.031     0.999890         9618      9102.22
      22.095     0.999902         9619     10240.00
      22.095     1.000000         9619          inf
#[Mean    =        3.059, StdDeviation   =        4.308]
#[Max     =       22.080, Total count    =         9619]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9667 requests in 10.24s, 769.84KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    944.31
Transfer/sec:     75.20KB