perfTest/stage4/get.txt
Running 10s test @ http://localhost:8080
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26ms  427.91us   5.47ms   66.81%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.55ms
 90.000%    1.77ms
 99.000%    2.30ms
 99.900%    2.46ms
 99.990%    4.99ms
 99.999%    5.47ms
100.000%    5.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.180     0.000000            1         1.00
       0.724     0.100000         1006         1.11
       0.862     0.200000         2005         1.25
       0.996     0.300000         3000         1.43
       1.132     0.400000         4004         1.67
       1.253     0.500000         5003         2.00
       1.315     0.550000         5502         2.22
       1.372     0.600000         6001         2.50
       1.431     0.650000         6507         2.86
       1.486     0.700000         7000         3.33
       1.549     0.750000         7503         4.00
       1.583     0.775000         7754         4.44
       1.618     0.800000         8002         5.00
       1.659     0.825000         8260         5.71
       1.693     0.850000         8502         6.67
       1.734     0.875000         8758         8.00
       1.752     0.887500         8875         8.89
       1.774     0.900000         9004        10.00
       1.807     0.912500         9128        11.43
       1.849     0.925000         9250        13.33
       1.934     0.937500         9375        16.00
       1.980     0.943750         9437        17.78
       2.027     0.950000         9502        20.00
       2.077     0.956250         9563        22.86
       2.119     0.962500         9630        26.67
       2.155     0.968750         9693        32.00
       2.177     0.971875         9719        35.56
       2.197     0.975000         9750        40.00
       2.215     0.978125         9785        45.71
       2.237     0.981250         9813        53.33
       2.259     0.984375         9843        64.00
       2.271     0.985938         9862        71.11
       2.281     0.987500         9876        80.00
       2.293     0.989062         9894        91.43
       2.305     0.990625         9906       106.67
       2.323     0.992188         9921       128.00
       2.331     0.992969         9931       142.22
       2.339     0.993750         9937       160.00
       2.349     0.994531         9945       182.86
       2.353     0.995313         9953       213.33
       2.363     0.996094         9961       256.00
       2.369     0.996484         9964       284.44
       2.373     0.996875         9969       320.00
       2.383     0.997266         9972       365.71
       2.391     0.997656         9977       426.67
       2.395     0.998047         9980       512.00
       2.399     0.998242         9982       568.89
       2.409     0.998437         9984       640.00
       2.431     0.998633         9986       731.43
       2.461     0.998828         9988       853.33
       2.493     0.999023         9990      1024.00
       2.589     0.999121         9991      1137.78
       2.623     0.999219         9992      1280.00
       3.103     0.999316         9993      1462.86
       3.347     0.999414         9994      1706.67
       3.861     0.999512         9995      2048.00
       3.861     0.999561         9995      2275.56
       4.215     0.999609         9996      2560.00
       4.215     0.999658         9996      2925.71
       4.735     0.999707         9997      3413.33
       4.735     0.999756         9997      4096.00
       4.735     0.999780         9997      4551.11
       4.991     0.999805         9998      5120.00
       4.991     0.999829         9998      5851.43
       4.991     0.999854         9998      6826.67
       4.991     0.999878         9998      8192.00
       4.991     0.999890         9998      9102.22
       5.475     0.999902         9999     10240.00
       5.475     1.000000         9999          inf
#[Mean    =        1.262, StdDeviation   =        0.428]
#[Max     =        5.472, Total count    =         9999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10000 requests in 10.00s, 799.71KB read
Requests/sec:   1000.01
Transfer/sec:     79.97KB