perfTest/stage4/put.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.66ms    5.52ms  36.45ms   85.39%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.38ms
 75.000%    2.11ms
 90.000%   12.06ms
 99.000%   23.87ms
 99.900%   28.46ms
 99.990%   32.56ms
 99.999%   36.48ms
100.000%   36.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.124     0.000000            1         1.00
       0.653     0.100000          964         1.11
       0.865     0.200000         1925         1.25
       1.055     0.300000         2891         1.43
       1.214     0.400000         3852         1.67
       1.385     0.500000         4813         2.00
       1.482     0.550000         5291         2.22
       1.584     0.600000         5772         2.50
       1.698     0.650000         6253         2.86
       1.845     0.700000         6733         3.33
       2.109     0.750000         7219         4.00
       2.295     0.775000         7454         4.44
       3.477     0.800000         7695         5.00
       6.559     0.825000         7936         5.71
       8.863     0.850000         8176         6.67
      10.479     0.875000         8416         8.00
      11.159     0.887500         8536         8.89
      12.087     0.900000         8657        10.00
      13.223     0.912500         8777        11.43
      14.895     0.925000         8897        13.33
      16.319     0.937500         9017        16.00
      17.199     0.943750         9078        17.78
      17.967     0.950000         9139        20.00
      18.831     0.956250         9198        22.86
      19.551     0.962500         9260        26.67
      19.999     0.968750         9318        32.00
      20.255     0.971875         9349        35.56
      20.767     0.975000         9379        40.00
      21.167     0.978125         9408        45.71
      21.791     0.981250         9438        53.33
      22.287     0.984375         9468        64.00
      22.623     0.985938         9483        71.11
      23.023     0.987500         9498        80.00
      23.535     0.989062         9513        91.43
      24.127     0.990625         9528       106.67
      24.543     0.992188         9543       128.00
      24.831     0.992969         9551       142.22
      25.071     0.993750         9558       160.00
      25.423     0.994531         9566       182.86
      25.759     0.995313         9574       213.33
      26.047     0.996094         9581       256.00
      26.191     0.996484         9585       284.44
      26.319     0.996875         9588       320.00
      26.431     0.997266         9592       365.71
      26.527     0.997656         9596       426.67
      28.303     0.998047         9600       512.00
      28.383     0.998242         9604       568.89
      28.383     0.998437         9604       640.00
      28.399     0.998633         9605       731.43
      28.447     0.998828         9607       853.33
      28.463     0.999023         9609      1024.00
      28.495     0.999121         9610      1137.78
      28.511     0.999219         9611      1280.00
      28.543     0.999316         9612      1462.86
      28.575     0.999414         9613      1706.67
      28.687     0.999512         9614      2048.00
      28.687     0.999561         9614      2275.56
      29.231     0.999609         9615      2560.00
      29.231     0.999658         9615      2925.71
      31.567     0.999707         9616      3413.33
      31.567     0.999756         9616      4096.00
      31.567     0.999780         9616      4551.11
      32.559     0.999805         9617      5120.00
      32.559     0.999829         9617      5851.43
      32.559     0.999854         9617      6826.67
      32.559     0.999878         9617      8192.00
      32.559     0.999890         9617      9102.22
      36.479     0.999902         9618     10240.00
      36.479     1.000000         9618          inf
#[Mean    =        3.659, StdDeviation   =        5.521]
#[Max     =       36.448, Total count    =         9618]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9643 requests in 10.24s, 781.62KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    942.06
Transfer/sec:     76.36KB